app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Tony"], ["email", "tony@gmail.com"], ["phone_number", 123456789], ["created_at", "2018-12-03 00:03:09.223789"], ["updated_at", "2018-12-03 00:03:09.223789"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save